<template>
  <q-page style="padding: 16px;
            display: flex;
           flex-direction: column;
           align-items: center;">
    <q-card class="my-card" style="width: 900px">
      <div style="align-items: center;padding: 10px">
        <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
          «Умное сельское хозяйство» - это концепция, которая основана на использовании различных инновационных технологий,
          которые позволяют повысить урожайность и автоматизировать сельскохозяйственную деятельность.
          Использование, сенсоров и датчиков один из важнейших шагов к созданию интеллектуальной фермы.
          Размещенные на десятках квадратных километров, используемые датчики могут непрерывно передавать по радиоканалам
          данные о состоянии контролируемой области. Этими данными могут быть: влажность, температура, уровень здоровья растений,
          запас воды
        </div>
        <q-img
          src="../assets/agriculture.png"
          style="height: 400px;width: 800px;flex-direction: column;
           align-items: center;"
          contain>
        </q-img>
        <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
          Система «сельского хозяйства» осуществляет автоматизированную поливку растений теплицы, поддержание внутреннего микроклимата, который будет задаваться заранее.
          Поливка растений осуществляется на основании данных датчика влаги почвы, если почва будет слишком сухой, то из резервуара с водой будет подаваться поток воды, который и будет увлажнять почву до нужного уровня. Когда будет достигаться заданный уровень влажности водный поток должен автоматически прекратиться.
          Для поддержания микроклимата внутри теплицы считываются показатели с датчиков температуры и влажности воздуха. На их основании будут работать вентилятор и нагревательный элемент.
        </div>
        <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
          Датчики, сенсоры и исполнительные устройства, которые необходимы при реализации:
          Модуль DHT11,
          Модуль YL-38,
          Вентилятор,
          Relay Shield,
          Мембранный вакуумный насос,
          Лампа накаливания
        </div>
      </div>
    </q-card>
  </q-page>
</template>

<script>
export default {
  name: 'AboutAgriculture'
}
</script>

<style scoped>

</style>
