<template>
  <q-page style="padding: 16px;
            display: flex;
           flex-direction: column;
           align-items: center;">
    <q-card class="my-card" style="width: 900px">
      <div style="align-items: center;padding: 10px">
        <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
          «Умный транспорт» - это общее название всех видов транспортных средств, использующих современные технологии
          связи для эффективного перемещения людей, взаимодействия между транспортными средствами и другими элементами
          дорожного движения.
          С увеличением количества транспортных средств, находящихся на дорогах, возникают проблемы перегруженности и
          нерационального использования дорожных ресурсов, которые влекут за собой многократного увеличения времени в пути,
          выбросов, загрязняющие окружающие среду. Поэтому развитие «умного транспорта» является актуальным.
          Решением таких проблем является комплекс внедряемых технологий. Для взаимодействия всех элементов транспортной
          системы (транспортные средства, светофоры, пешеходы, дорожные знаки и т.д.)  используются технологии беспроводные
          технологии передачи данных (Wi-Fi, NB- IoT и т.д.), сотовая связь (3G, 4G, LTE) и различные модули и датчики,
          например, GPS/ГЛОНАСС.

        </div>
      </div>
    </q-card>
  </q-page>
</template>

<script>
export default {
  name: 'AboutTransport'
}
</script>

<style scoped>

</style>
