<template>
  <q-page style="padding: 16px;
            display: flex;
           flex-direction: column;
           align-items: center;">
    <q-card class="my-card" style="width: 900px">
        <div style="align-items: center;padding: 10px">
          <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
            «Умное дом» - часть концепции умного города, отвечающая за автоматизацию жилищно-коммунального хозяйства для
            своевременного получения показаний счетчиков, контроля работы оборудования, предотвращения аварийных ситуаций,
            прозрачности работы объектов ЖКХ.
            «Умным дом» включает в себя такие задачи, как эффективно использовать энергоресурсов и водных ресурсов,
            обеспечения комфорта условий проживания, автоматизация снятия и передачи данных с датчиков и счетчиков,
            удобный контроль над потребление коммунальных услуг через онлайн сервисы и личные кабинет, а также автоматизированный
            контроль условий проживаний.
            <p>Выделяют три уровня  «умного  ЖКХ»:</p>
            <p>Локальный уровень – счетчики в квартирах и домах.</p>
            <p>Уровень сбора показаний счетчиков - для передачи показаний умные счетчики пользуются различными
              беспроводными и проводными технологиями: Wi-Fi, NB-IoT, PLC и другие.</p>
            <p>Уровень обработки и анализа данных -  доступ к результатам, полученным на данном уровне,
              может получить любой авторизованный пользователь через личный кабинет.</p>
          </div>
          <div style="
                      top: 0;
                      right: 0;
                      bottom: 0;
                      left: 0;
                      margin: auto;">
            <q-img
              src="../assets/smarthome.png"
              style="height: 222px;width: 627px;"
              contain>
            </q-img>
          </div>
          <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;" >
            Система «умный дом» - представляет из себя макет, где все коммунальные системы (водоснабжения, энергообеспечения, вентиляции, кондиционирования, отопления и прочие) работают в комплексе и подчинены одной цели – обеспечить жильцам максимальный комфорт и защищенность. «Умный дом» включает в себя следующие системы автоматизации:
            <p>УПАРВЛЕНИЕ ОСВЕЩЕНИЕМ. Система должна в зависимости от внешнего освещения включать светодиодную лампу. Если в комнате темно, то необходимо свериться с датчиком движения. При наличии движения, свет включается. Если темно и человек наступает на площадку возле кровати, то свет также включается. В других случаях свет не включается;
            </p>
            <p>ЦЕНТРОЛИЗОВАННОЕ УПРАВЛЕНИЕ ЛИФТОМ. Принцип действия данной системы заключается в следующем: при открытии двери и отжатии кнопки лифт должен подниматься на этаж. Два привода поднимают лифт, кнопки для вызова лифта устанавливаются в двери перед лифтом;
            </p>
            <p>КЛИМАТ-КОНТРОЛЬ, включая управление системой вентиляции и кондиционирования. Данная система осуществляет поддержание комфортной температуры воздуха в помещении. Благодаря нагревательному элементу в холодное время года, в помещении будет тепло, а с помощью вентилятора в теплое время года не будет жарко.
            </p>
            <p>УПАРАВЛЕНИЕ И МОНИТОРИНГ ИНДЕНТИФИКАЦИИ ВХОДА(безопасность) по отпечатку пальца. Вход в помещение осуществляется по идентификации отпечатка пальца. Если отпечаток совпадает с отпечатком в базе, то дверь открывается на 5-10 секунд.
            </p>
          </div>
          <div class="q-body-2" style="font-size: 18px; font-family: Arial; text-align: center;">
            Датчики, сенсоры и исполнительные устройства, которые необходимы при реализации:
            Светодиодная лента SMD 5630,
            Фоторезистор Arduino,
            Датчик движения HC-SR501,
            Trema-модуль Кнопка,
            Сервопривод Tower Pro MG996R,
            Trema-модуль Кнопка,
            Пьезоэлектрический излучатель,
            Trema-модуль OLED-дисплей,
            Высокоскоростной мотор MOTOR-201210,
            Светодиоды,
            Trema-модуль Потенциометр,
            Сервопривод Tower Pro MG996R,
            Модуль отпечатков пальцев FPM10A,
            Trema-модуль OLED-дисплей
          </div>
        </div>
    </q-card>
  </q-page>
</template>

<script>

export default {
  name: 'AboutSmartHome'
}
</script>

<style scoped>

</style>
