<template>
  <q-page style="padding: 16px;
            display: flex;
           flex-direction: column;
           align-items: center;">
    <q-card class="my-card" style="width: 900px">
      <div class="q-px-lg q-pb-md">
        <q-timeline color="secondary">
          <q-timeline-entry heading>
            Хронология разработки системы управления "Умный город"
          </q-timeline-entry>

          <q-timeline-entry
            subtitle="Сентябрь 2018"
          >
            <div>
              Формирования задания и требовний. Установка хронологического порядка плана работы.
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Анализ предметной области применения IoT в системе «Умный город»"
            subtitle="Декабрь 2018"
          >
            <div>
              Рассмотрено понятие «Smart city» и история развития «умных городов».
              Проведено ознакомление с городами, которые многие специалисты относят к «умным городам», проведен анализ внедряемых современных технологий в различных городах мира.
              Были изучены основные системы «умного города», так как: «умное ЖКХ», «умный транспорт», «умное производство», «умное сельское хозяйство», «умное здравоохранение», «умное образование».
              Проведен анализ аналоги имитационной модели «умный город», где были выдели основные особенности и цели разработки таких стендов и моделей.
              Рассмотрены основные платформы, а также языки программирования и среды разработки, которые будут применяться при проектировании и разработки имитационной модели «умный город».

            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="FRUCT 2019"
            subtitle="Апрель 2019"
            color="orange"
            icon="done_all"
          >
            <div>
              Выступление на конференции и публикаия на Finnish-Russian University Cooperation in Telecommunication (FRUCT) 2019. Наименование работы: "Development of Educational and Laboratory Stand «Smart City Systems»"
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Исследовании моделей и методов разработки IoT-систем, средств разработки проектных решений по направлению системы «Умный город»."
            subtitle="Июнь 2019"
          >
            <div>
              Рассмотрена сетевая архитектура IoT, а именно как взаимодействуют между собой «физические» и «виртуальные» вещи. Проведен анализ существующих платформ, для обеспечения взаимодействия IoT компонентов.
              Проведен анализ интерфейса прикладных программ (API), то есть способ взаимодействия между компонентами модели. А также рассмотрены форматы передачи данных в клиент-серверной архитектуре.
              Проанализирована взаимосвязь между контроллером Arduino и Raspberry Pi, а также способ их взаимодействия с ЦОДом.
              Рассмотрены способы сбора и хранения информации. Проведена сравнительная характеристика между известными базами данных, основываясь на который была выбрана PostgreSQL.
              Построена сетевая архитектура модели, где показаны способы взаимодействия между основными системами.

            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="Проектирование системы управления учебно-исследовательского стенда «Системы умного города». Часть 1"
            subtitle="Сентябрь 2019"
          >
            <div>
              Рассмотрено проектирование системы управления учебно-исследовательского стенда «Системы умного города».
              Определена аппаратная реализация стенда, выбраны основные виды устройств для каждого логического уровня. Определены основные слои сервер приложений систем умного города: Model, JPA (Java Persistence API), Repository, Service, Controller.
              Определен вариант взаимодействия между сервер приложения стенда – локальная  Wi-Fi сеть, которую обеспечивает Wi-Fi роутер и адаптер.
            </div>
          </q-timeline-entry>
          <q-timeline-entry
            title="Проектирование системы управления учебно-исследовательского стенда «Системы умного города». Часть 2"
            subtitle="Декабрь 2019"
          >
            <div>
              Рассмотрено проектирование системы управления учебно-исследовательского стенда «Системы умного города».
              Спроектированы и определены вспомогательные технологии для реализации сервер приложений «back-end» и «front-end», а именно фрэйворки Spring и Vue.js?. Спроектирована инфологическая модель базы данных для хранения информации, получаемой от расположенных на стенде систем.
              Определены требования к технологии обмена данных по стандарту 802.11n.Выбран архитектурный стиль взаимодействия REST между модулями стенда и опре-делен протокол HTTP c использованием формата данных JSON.
              Описана структура программных интерфейсов сервер-приложений. Подготовлены рекомендации для реализации спроектированных программных интерфейсов сервер-приложений.
            </div>
          </q-timeline-entry>

          <q-timeline-entry
            title="ТИО 2020"
            subtitle="Март 2020"
            color="orange"
            icon="done_all"
          >
            <div>
              Выступление на конференции и публикация на XIV МЕЖДУНАРОДНОЙ ОТРАСЛЕВОЙ
              НАУЧНО-ТЕХНИЧЕСКОЙ КОНФЕРЕНЦИИ
              «ТЕХНОЛОГИИ ИНФОРМАЦИОННОГО ОБЩЕСТВА». Наименование работы: "Проектирование программных  интерфейсов для взаимодействия между сервер приложениями учебно-исследовательского стенда «Системы умного города»"
            </div>
          </q-timeline-entry>
          <q-timeline-entry
            title="АЛМАЗ 2020"
            subtitle="Апрель 2020"
            color="orange"
            icon="done_all"
          >
            <div>
              Отправка работ на XIV студенческой конференции ПАО «НПО «Алмаз». Наименование работы: "Проектирование системы управления учебно-исследовательского стенда «Системы умного города»"
            </div>
          </q-timeline-entry>

        </q-timeline>
      </div>
    </q-card>
  </q-page>
</template>

<script>
export default {
  name: 'Setting'
}
</script>

<style scoped>

</style>
